#### Terraform Format and Style - `success`
#### Terraform Initialization - `success`
#### Terraform Plan - `failure`          

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.remote["connectivity"]: Reading...
data.terraform_remote_state.remote["current"]: Reading...
data.terraform_remote_state.remote["current"]: Read complete after 1s
data.terraform_remote_state.remote["connectivity"]: Read complete after 2s
module.landingzone.data.azurerm_client_config.current: Reading...
module.landingzone.data.azurerm_client_config.current: Read complete after 0s [id=2023-03-22 07:19:52.063746063 +0000 UTC]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Reading...
module.landingzone.data.azurerm_subscription.primary: Reading...
module.landingzone.data.azurerm_subscription.primary: Read complete after 0s [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Read complete after 0s [id=2b3020e2-22c9-4b01-b88e-95624dbd2f23]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2023-03-22 07:19:52.645748223 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.aks will be created
  + resource "azurecaf_name" "aks" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "akscluster-re1"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_kubernetes_cluster"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.default_node_pool will be created
  + resource "azurecaf_name" "default_node_pool" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "sharedsvc"
      + passthrough   = true
      + random_length = 3
      + resource_type = "aks_node_pool_linux"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.rg_node will be created
  + resource "azurecaf_name" "rg_node" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "app-nonprod-rg"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.aks_clusters["aks_nonprod"].random_string.prefix will be created
  + resource "random_string" "prefix" {
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = (known after apply)
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.landingzone.module.container_registry["acr1"].azurecaf_name.acr will be created
  + resource "azurecaf_name" "acr" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lz-nonprod-acr"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_container_registry"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.container_registry["acr1"].azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + georeplication_locations      = (known after apply)
      + georeplications               = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + login_server                  = (known after apply)
      + name                          = (known after apply)
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = (known after apply)
      + retention_policy              = (known after apply)
      + sku                           = "Premium"
      + storage_account_id            = (known after apply)
      + tags                          = {
          + "module" = "container_registry"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.landingzone.module.keyvaults["kv1"].azurecaf_name.keyvault will be created
  + resource "azurecaf_name" "keyvault" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "nonprodkeyvault"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_key_vault"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.keyvaults["kv1"].azurerm_key_vault.keyvault will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = false
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = (known after apply)
      + purge_protection_enabled        = false
      + resource_group_name             = (known after apply)
      + sku_name                        = "standard"
      + soft_delete_enabled             = (known after apply)
      + soft_delete_retention_days      = 7
      + tenant_id                       = "95f1c0e9-c50b-4882-87de-bb2470f0d5ad"
      + vault_uri                       = (known after apply)

      + timeouts {
          + delete = "60m"
        }
    }

  # module.landingzone.module.managed_identities["nonprodapp_mi"].azurecaf_name.msi will be created
  + resource "azurecaf_name" "msi" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "dvt_db_mi"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_user_assigned_identity"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.managed_identities["nonprodapp_mi"].azurerm_user_assigned_identity.msi will be created
  + resource "azurerm_user_assigned_identity" "msi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.landingzone.module.managed_identities["nonprodapp_mi"].time_sleep.propagate_to_azuread will be created
  + resource "time_sleep" "propagate_to_azuread" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.landingzone.module.mssql_databases["mssql_db1"].azurecaf_name.mssqldb will be created
  + resource "azurecaf_name" "mssqldb" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "exampledb1"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_mssql_database"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.mssql_databases["mssql_db1"].azurerm_mssql_database.mssqldb will be created
  + resource "azurerm_mssql_database" "mssqldb" {
      + auto_pause_delay_in_minutes = (known after apply)
      + collation                   = (known after apply)
      + create_mode                 = "Default"
      + creation_source_database_id = (known after apply)
      + extended_auditing_policy    = (known after apply)
      + geo_backup_enabled          = true
      + id                          = (known after apply)
      + license_type                = "LicenseIncluded"
      + max_size_gb                 = 4
      + min_capacity                = (known after apply)
      + name                        = (known after apply)
      + read_replica_count          = (known after apply)
      + read_scale                  = (known after apply)
      + restore_point_in_time       = (known after apply)
      + sample_name                 = (known after apply)
      + server_id                   = (known after apply)
      + sku_name                    = "BC_Gen5_2"
      + storage_account_type        = "GRS"
      + tags                        = {
          + "module" = "mssql_database"
        }
      + zone_redundant              = (known after apply)
    }

  # module.landingzone.module.mssql_servers["mssqlserver1"].azurecaf_name.mssql will be created
  + resource "azurecaf_name" "mssql" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "nonprod-mssqlserver"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_sql_server"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.mssql_servers["mssqlserver1"].azurerm_key_vault_secret.sql_admin_password[0] will be created
  + resource "azurerm_key_vault_secret" "sql_admin_password" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.landingzone.module.mssql_servers["mssqlserver1"].azurerm_mssql_server.mssql will be created
  + resource "azurerm_mssql_server" "mssql" {
      + administrator_login                  = "sqluseradmin"
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + extended_auditing_policy             = (known after apply)
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "westeurope"
      + name                                 = (known after apply)
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = (known after apply)
      + restorable_dropped_database_ids      = (known after apply)
      + tags                                 = {
          + "module" = "mssql_server"
        }
      + version                              = "12.0"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.landingzone.module.mssql_servers["mssqlserver1"].random_password.sql_admin[0] will be created
  + resource "random_password" "sql_admin" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 128
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "$#%"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.landingzone.module.networking["spoke_re1"].azurecaf_name.caf_name_vnet will be created
  + resource "azurecaf_name" "caf_name_vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "aks"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.networking["spoke_re1"].azurerm_subnet_network_security_group_association.nsg_vnet_association["aks_nodepool_system"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_vnet_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.landingzone.module.networking["spoke_re1"].azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space         = [
          + "10.1.0.0/16",
        ]
      + dns_servers           = []
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westeurope"
      + name                  = (known after apply)
      + resource_group_name   = (known after apply)
      + subnet                = (known after apply)
      + tags                  = {
          + "module" = "virtual_network"
        }
      + vm_protection_enabled = false
    }

  # module.landingzone.module.resource_groups["nonprod-rg"].azurecaf_name.rg will be created
  + resource "azurecaf_name" "rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "app-nonprod-rg"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.resource_groups["nonprod-rg"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = (known after apply)
    }

  # module.landingzone.module.networking["spoke_re1"].module.nsg.azurecaf_name.nsg_obj["aks_nodepool_system"] will be created
  + resource "azurecaf_name" "nsg_obj" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "aks_nodepool_system"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.networking["spoke_re1"].module.nsg.azurerm_network_security_group.nsg_obj["aks_nodepool_system"] will be created
  + resource "azurerm_network_security_group" "nsg_obj" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = []
      + tags                = {
          + "module" = "virtual_network"
        }
    }

  # module.landingzone.module.networking["spoke_re1"].module.subnets["aks_nodepool_system"].azurecaf_name.subnet will be created
  + resource "azurecaf_name" "subnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "aks_nodepool_system"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.networking["spoke_re1"].module.subnets["aks_nodepool_system"].azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.1.1.0/20",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = []
      + virtual_network_name                           = (known after apply)
    }

  # module.landingzone.module.networking["spoke_re1"].module.subnets["private_endpoints"].azurecaf_name.subnet will be created
  + resource "azurecaf_name" "subnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "private_endpoints"
      + passthrough   = true
      + random_length = 3
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = false
    }

  # module.landingzone.module.networking["spoke_re1"].module.subnets["private_endpoints"].azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.1.16.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = []
      + virtual_network_name                           = (known after apply)
    }

  # module.landingzone.module.keyvaults["kv1"].module.initial_policy[0].module.logged_in_aad_app["logged_in_aad_app"].azurerm_key_vault_access_policy.policy will be created
  + resource "azurerm_key_vault_access_policy" "policy" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = "2b3020e2-22c9-4b01-b88e-95624dbd2f23"
      + secret_permissions = [
          + "Set",
          + "Get",
          + "List",
          + "Delete",
        ]
      + tenant_id          = "95f1c0e9-c50b-4882-87de-bb2470f0d5ad"

      + timeouts {
          + delete = "60m"
        }
    }

  # module.landingzone.module.keyvaults["kv1"].module.initial_policy[0].module.managed_identity["managed_identity"].azurerm_key_vault_access_policy.policy will be created
  + resource "azurerm_key_vault_access_policy" "policy" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Set",
          + "Get",
          + "List",
          + "Delete",
          + "Purge",
        ]
      + tenant_id          = "95f1c0e9-c50b-4882-87de-bb2470f0d5ad"

      + timeouts {
          + delete = "60m"
        }
    }

Plan: 30 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + global_settings = (sensitive value)
  + tfstates        = (sensitive value)

Warning: Argument is deprecated

  with module.landingzone.module.api_management_custom_domain.azurerm_api_management_custom_domain.apim,
  on ../dvt-caf/modules/apim/api_management_custom_domain/module.tf line 1, in resource "azurerm_api_management_custom_domain" "apim":
   1: resource "azurerm_api_management_custom_domain" "apim" {

`proxy` is deprecated and will be renamed to `gateway` in version 3.0 of the
AzureRM provider
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @rafaelherik, Action: `pull_request`*